[
  "How do you make a pool table laugh? Tickle its balls.",
  "What does the sign on an out-of-business brothel say? “Beat it. We’re closed!”",
  "Did you fart? No, that was my butt blowing you a kiss.",
  "Three pregnant women visited a hospital to check the gender of their babies. While chatting in the waiting room, one lady said she’s sure hers is a boy because she was on the bottom during sex. The second one went ahead to say that hers will be a girl because she was on top. The third one, a blonde, remarked ‘‘can’t wait to see my puppies!’’",
  "What’s the best help you can give to a constipating person? Well, scare the shit outta them!",
  "“Baby, is it in?” “Not yet.” “Does it hurt?” “A little.” “Let me push it in slowly.” “Still hurts?” “Yeah.” “Damn, let’s try another shoe.”",
  "I once asked Siri why I was single. The front-facing camera turned on.",
  "My girlfriend’s dog died, so I tried to cheer her up by getting her an identical one. It just made her more upset. She screamed at me and said, “What am I supposed to do with two dead dogs?”",
  "Why are friends a lot like snow? If you pee on them, they disappear.",
  "My grandfather says I’m too reliant on technology. I called him a hypocrite and unplugged his life support.",
  "6:30 is my favorite time of day, hands down.",
  "Dear Math, grow up and solve your own problems.",
  "Did you hear the rumor about butter? Well, I’m not going to go spreading it!",
  "I’m reading an anti-gravity book. I can’t put it down!",
  "I’m so good at sleeping that I do it with my eyes closed.",
  "It’s inappropriate to make a “dad joke” if you’re not a dad. It’s a faux pa.",
  "Why didn't Barbie ever get pregnant? Because Ken always came in another box.",
  "What do tofu and a vibrator have in common? They are both meat substitutes.",
  "What is the difference between an oral and a rectal thermometer? The taste.",
  "Do you know why a witch never wears panties? More grip on the broom.",
  "Ever fooled around while camping? It’s fucking in-tents!",
  "An old married couple was in church one Sunday. The woman turns to her husband and says: “I’ve just let out a really long, silent fart. What should I do?” The husband replies: “Replace the battery in your hearing aid.”",
  "What did one butt cheek say to the other? “Together, we can stop this shit!”",
  "I got a vasectomy but my girlfriend still got pregnant. Apparently, all a vasectomy does is change the color of the baby.",
  "My girlfriend dressed up as a policewoman and told me I was under arrest on suspicion of being good in bed. After two minutes she said all charges were being dropped due to a lack of evidence.",
  "I have bathed in the blood of virgins. And by that I mean that I had a nosebleed in the shower.",
  "My son kept messing around with electrical cords. So I grounded him. He's doing better now and is conducting himself properly.",
  "Why are orphans usually bad at dodge ball? Because almost no one ever misses them.",
  "My grief counselor died. He was so good, that I don’t even care.",
  "I started crying when dad was cutting onions. Onions was my favorite pet cat.",
  "How can you know when the dishwasher has stopped working? She’s in bed next to you.",
  "While everyone criticized my cooking, the smoke detector thought it was lit.",
  "Why does it take 100 million sperm to find and fertilize one egg? Because they simply won't stop to ask for directions.",
  "I've just had the worst day: my ex-girlfriend got hit by a truck. Just a few hours later, I also lost my job as a truck driver.",
  "What’s the difference between the United States and Canada? The United States have very friendly, courteous neighbors.",
  "My parents raised me as an only child. It really made my sister upset.",
  "In Alabama, what is it called when you turn your back on family? Reverse cowgirl.",
  "If someone calls you fat, you should just ignore them. You're the bigger person after all.",
  "How do you turn any salad into a Caesar salad? You stab it 23 times.",
  "The priest asks a convict in the electric chair, “Any last requests, sir?” “Yes,” replies the convict. “While I get electrocuted, would you please kindly hold my hand?”",
  "They all laughed at my crayon drawings. I laughed at all their chalk outlines.",
  "My wife and I decided that we didn't want children. If anybody does, you can go and collect ours from somewhere along the I-95.",
  "Why can’t Michael Jackson go within 200 meters of a school? He’s dead.",
  "“I’m sorry” and “I apologize” have the same meaning. Unless you’re at a funeral.",
  "A skydiver doesn't even need a parachute. But he needs a parachute if he wants to skydive a second time.",
  "My eldest relatives used to tease me at weddings by saying, “You’ll be next!” but they stopped once I started doing the same to them at funerals.",
  "My wife asked me to count my sexual partners. I should have stopped when I got to her.",
  "My wife was upset that I always get lost. So I took all my belongings and I right.",
  "How is life like toilet paper? You're either on a roll or taking shit from someone.",
  "When should you use protection? Every conceivable occasion!"
]